#include "int.h"
#include "HC89S003F4.h"
u8 tx_flag;
void int_init(void)
{
	P2M3 = P2M3&0x0F|0x40;				//P27设置为带SMT输入
	PITS3 |= 0x40;						//INT15下降沿中断
	PINTE1 |= 0x80;						//使能INT15
	IE1 |= 0x80;						//打开INT8-15中断
	EA = 1;
}

/***************************************************************************************
  * @说明  	INT8-15中断服务函数
  *	@参数	无
  * @返回值 无
  * @注		无
***************************************************************************************/
void INT8_15_Rpt() interrupt INT8_15_VECTOR 
{
	if(PINTF1&0x80)						//判断INT15中断标志位
	{
		PINTF1 &=~ 0x80;				//清除INT15中断标志位	
		tx_flag = 1;
	}
}